trunk/core/src/test/resources/org/springframework/ws/soap/addressing/200605/request-anonymous.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <S:Header>
        <wsa:MessageID>http://example.com/someuniquestring</wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:To>mailto:fabrikam@example.com</wsa:To>
        <wsa:Action>http://example.com/fabrikam/mail/Delete</wsa:Action>
    </S:Header>
    <S:Body>
        <f:Delete xmlns:f="http://example.com/fabrikam">
            <maxCount>42</maxCount>
        </f:Delete>
    </S:Body>
</S:Envelope>
